tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "spring-io/tap"

brew "awscli"
brew "bash"
brew "bash-snippets"
brew "bat"
brew "brew-cask-completion"
brew "cloc"
brew "colordiff"
brew "coreutils"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "gradle"
brew "htop"
brew "httpie"
brew "jenv"
brew "kotlin"
brew "m-cli"
brew "mackup"
brew "mas"
brew "maven"
brew "mdv"
brew "neofetch"
brew "nmap"
brew "node"
brew "openssh"
brew "openssl@1.1"
brew "p11-kit"
brew "perl"
brew "python@3.9"
brew "readline"
brew "ruby"
brew "shellcheck"
brew "speedtest_cli"
brew "spring-boot"
brew "sqlite"
brew "svn"
brew "telegram-cli"
brew "terminal-notifier"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "trash"
brew "tree"
brew "urlview"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"
brew "xz"
brew "yarn"
brew "zplug", args: ["HEAD"]
brew "zsh"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "adoptopenjdk"
cask "alfred"
cask "appcleaner"
cask "avast-security" # not working -> manual install
cask "balenaetcher"
cask "cheatsheet"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "font-inconsolata-nerd-font"
cask "gimp"
cask "google-chrome"
cask "google-drive-file-stream"
cask "gpg-suite"
cask "handbrake"
cask "intellij-idea"
cask "iterm2"
cask "itsycal"
cask "jdownloader"
cask "libreoffice"
cask "monitorcontrol"
cask "nordvpn"
cask "onyx"
cask "quicklook-csv"
cask "quicklook-json"
cask "skype"
cask "slack"
cask "spectacle"
cask "steam"
cask "the-unarchiver"
cask "tor-browser"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "zoomus"
